In [1]:
import pandas as pd
import numpy as np

## read data from csv file

In [6]:
df = pd.read_csv('data.csv',sep=' ')

In [8]:
df_sub = df.dropna()

In [15]:
df

,date,time,epoch,moteid,temperature,humidity,light,voltage
0,2004-03-31,03:38:15.757551,2,1.0,122.1530,-3.91901,11.04,2.03397
1,2004-02-28,00:59:16.02785,3,1.0,19.9884,37.09330,45.08,2.69964
2,2004-02-28,01:03:16.33393,11,1.0,19.3024,38.46290,45.08,2.68742
3,2004-02-28,01:06:16.013453,17,1.0,19.1652,38.80390,45.08,2.68742
4,2004-02-28,01:06:46.778088,18,1.0,19.1750,38.83790,45.08,2.69964
...,...,...,...,...,...,...,...,...
2313677,2004-04-02,01:14:54.164318,61274,NaN,NaN,NaN,NaN,NaN
2313678,2004-04-02,01:17:53.670524,61275,NaN,NaN,NaN,NaN,NaN
2313679,2004-04-02,01:20:52.807972,61276,NaN,NaN,NaN,NaN,NaN
2313680,2004-04-02,01:26:53.950342,61278,NaN,NaN,NaN,NaN,NaN
2313681,2004-04-02,01:35:53.897412,61280,NaN,NaN,NaN,NaN,NaN

In [22]:
pd.unique(df_sub['moteid'])

array([ 1.,  2.,  3.,  4.,  6.,  7.,  8.,  9., 10., 11., 12., 13., 14.,
       15., 16., 17., 18., 19., 20., 21., 22., 23., 24., 25., 26., 27.,
       29., 30., 31., 32., 33., 34., 35., 36., 37., 38., 39., 40., 41.,
       42., 43., 44., 45., 46., 47., 48., 49., 50., 51., 52., 53., 54.,
       55., 56., 58.])

In [24]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2219803 entries, 0 to 2313152
Data columns (total 8 columns):
 #   Column       Dtype
---  ------       -----
 0   date         object
 1   time         object
 2   epoch        int64
 3   moteid       int64
 4   temperature  float64
 5   humidity     float64
 6   light        float64
 7   voltage      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 232.4+ MB

In [25]:
df1 = df_sub[df_sub['moteid'] == 1]

In [36]:
df2 = df_sub[df_sub['epoch'] == 5]

In [44]:
# missing ratio
(len(df)-len(df_sub)) * 100 / len(df)

4.057558471734664

## Convert date & time to datetime

In [66]:
df_sub.to_hdf('data.h5','df_sub')

In [78]:
df_sub['datetime'] = df_sub['date']+' '+df_sub['time']

In [80]:
df_sub['datetime'] = pd.to_datetime(df_sub['datetime'])

In [84]:
df_sub

,date,time,epoch,moteid,temperature,humidity,light,voltage,date_new,time_new,datetime
0,2004-03-31,03:38:15.757551,2,1,122.1530,-3.91901,11.04,2.03397,2004-03-31,03:38:15.757551,2004-03-31 03:38:15.757551
1,2004-02-28,00:59:16.02785,3,1,19.9884,37.09330,45.08,2.69964,2004-02-28,00:59:16.027850,2004-02-28 00:59:16.027850
2,2004-02-28,01:03:16.33393,11,1,19.3024,38.46290,45.08,2.68742,2004-02-28,01:03:16.333930,2004-02-28 01:03:16.333930
3,2004-02-28,01:06:16.013453,17,1,19.1652,38.80390,45.08,2.68742,2004-02-28,01:06:16.013453,2004-02-28 01:06:16.013453
4,2004-02-28,01:06:46.778088,18,1,19.1750,38.83790,45.08,2.69964,2004-02-28,01:06:46.778088,2004-02-28 01:06:46.778088
...,...,...,...,...,...,...,...,...,...,...,...
2313148,2004-04-02,09:06:21.488182,62421,58,24.1730,21.65750,1729.60,2.78836,2004-04-02,09:06:21.488182,2004-04-02 09:06:21.488182
2313149,2004-04-02,09:07:22.173243,62423,58,24.1436,21.73100,1729.60,2.78836,2004-04-02,09:07:22.173243,2004-04-02 09:07:22.173243
2313150,2004-04-02,09:07:52.31387,62424,58,24.1436,21.65750,1670.72,2.78836,2004-04-02,09:07:52.313870,2004-04-02 09:07:52.313870
2313151,2004-04-02,09:08:52.189274,62426,58,24.1240,21.58390,1670.72,2.78836,2004-04-02,09:08:52.189274,2004-04-02 09:08:52.189274
2313152,2004-04-02,09:09:22.206544,62427,58,24.1044,21.43670,1729.60,2.78836,2004-04-02,09:09:22.206544,2004-04-02 09:09:22.206544

## read df_sub

In [ ]:
df_sub = pd.read_hdf('data1.h5','df_sub')

In [125]:
df_sub1.to_hdf('data1.h5','df_sub')

In [121]:
column_list = ['datetime','epoch', 'moteid', 'temperature', 'humidity', 'light', 'voltage']

In [123]:
df_sub = df_sub[column_list]